/* General */

"YES" = "YES";

"Coming soon" = "Coming soon";

"Calculation error" = "Calculation mistake";

"and" = "and";

"Answer" = "Answer";

"Name" = "Name";

"NO" = "NO";

"Solution" = "Solution";

"solution" = "through operation";

"Task" = "Problem";

"Save & Exit" = "Save & Exit";

"You can't delete error." = "You can't delete a solution in which you made a mistake.";

"Message" = "Message";

/* level map */

"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type" = "Oops! Ты допустил больше двух ошибок. Ты не можешь дальше продолжать решать тестовые задачи, пока не решишь все задачи этого типа.";

/* S&E level page label */
"Problem" = "Задача";

"problem" = "задача";

"Training" = "Обучающая";


/* Exercises page */
"%@ points from %@" = "%1$@ очков из %2$@";

"find one more way to solve this problem and earn %d points more" = "найди еще варианты решения этой задачи и заработай еще %d очков";

"you have solved this problem with all possible solution and expression" = "Ты нашел все возможные варианты решений";




/* Exercises page */
"%@ points from %@" = "%1$@ points out of %2$@";

/* Got star for test level completion */
"%02i.%02i %@ (Got star)" = "%1$i.%2$i %3$@ (Got star)";

/* Solved level/path */
"%02i.%02i %@ (Solved)" = "%1$i.%2$i %3$@ (Solved)";

/* Solving page */
"Add answer" = "Add answer";

/* Add action to Solving page */
"Add operation?" = "Add operation?";




/* Solving page */
"Answer field is empty" = "Answer field is empty";

/* Solving page */
"Answers are not identical to each other." = "Answers do not match to each other.";

/* Logout alert message */
"Are you sure you want to exit your profile? All your data will be save and you can come back any time." = "Are you sure you want to exit your profile? All your data will be saved and you can come back any time.";



/* Logout alert cancel button */
"Cancel" = "Cancel";

/* Solving page */
"Change answer" = "Change answer";

/* Home screen on tap Olympiad */
"Child not selected." = "Child not selected.";



/* Statistics */
"Day" = "Day";

/* Delete subaction label at Solving page */
"Delete" = "Delete";

/* Remove action from Solving page */
"Delete operation?" = "Delete operation?";

/* Choose child popup */
"Enter child name" = "Enter child name";

/* Mail registration  popup */
"Enter your account" = "Enter your account";

/* Settings */
"Enter your facebook account to continue" = "Enter your facebook account to continue";

/* Settings */
"Enter your mail account to continue" = "Enter your e-mail account to continue";

/* Mail registration  popup */
"Enter your password" = "Enter your password";

/* Profile achievements event status */
"Error" = "Mistake";

/* No comment provided by engineer. */
"Expression" = "Math Expression";

/* No comment provided by engineer. */
"expression" = "expression";

/* Exercises page */
"find one more way to solve this problem and earn %d points more" = "find one more way to solve this problem and earn %d more points";



/* Statistics */
"Month" = "Month";

/* Logout alert accept button */
"OK" = "OK";

/* Warning on attempt to solve test tasks with 2 tasks failed already */
"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type" = "Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type";

/* S&E level page label */
"Problem" = "Problem";

/* S&E level page label */
"problem" = "problem";





/* Solved level/path */
"Solved" = "Solved";

/* Profile achievements event status */
"Solved task" = "Solved";

/* Profile achievements event status */
"Started task" = "Started";

/* Popup error description */
"Structure and calculation error" = "Comprehansion and calculation mistake";

/* Popup error description */
"Structure error" = "Comprehansion mistake";



/* Solving page */
"Task can have just one correct answer! Input the same ANSWER to all fields" = "Problem has only one correct answer! Input the same ANSWER into all fields";

/* No comment provided by engineer. */
"Task is not solved with all possible variants." = "Not all possible solutions have been found.";

/* No comment provided by engineer. */
"Task is solved with all possible solutions and expressions" = "All possible solutions have been found";

/* Olympiad solving page */
"There are empty gaps. You should fill every gap" = "There are still blank spaces. You should fill them in";

/* S&E level page label */
"Training" = "Training";

/* Statistics */
"Understanding error" = "Comprehansion mistake";

/* Statistics */
"Week" = "Week";



/* Solving page */
"You can add just expression for this task!" = "This problem can only be solved with the help of an expression!";



/* Solving page */
"You have added all possible expressions" = "You have found all possible solutions by expression";

/* Solving page */
"You have added all possible solutions" = "You have found all possible solutions through operations";

/* Exercises page */
"you have solved this problem with all possible solution and expression" = "All possible solutions have been found";

/* Mail registration  popup */
"You should input all rows" = "You should input all fields";

/* Back-end errors */
 
 /* No comment provided by engineer. */
"Unable to perform action" = "Unable to perform action";

/* No comment provided by engineer. */
"Email and Password fields are required" = "Email and Password fields are required";

/* No comment provided by engineer. */
"Incorrect email format" = "Incorrect email format";

/* No comment provided by engineer. */
"User with same email already exists" = "User with same email already exists";

/* No comment provided by engineer. */
"Incorrect password" = "Incorrect password";

/* No comment provided by engineer. */
"User not found" = "User not found";

/* No comment provided by engineer. */
"User not found, you need to specify email to register" = "User not found, you need to specify email to register";

/* No comment provided by engineer. */
"Name field is required" = "Name field is required";

/* No comment provided by engineer. */
"Child with this name already exists" = "Child with this name already exists";

/* No comment provided by engineer. */
"Child not found" = "Child not found";

/* No comment provided by engineer. */
"You need to set active child" = "You need to choose active child";

/* No comment provided by engineer. */
"Permissions Denied" = "Permissions Denied";

/* No comment provided by engineer. */
"Authorization Error" = "Authorization Error";

/* No comment provided by engineer. */
"Synchronizing. Tap to cancel" = "Synchronizing. Tap to cancel";

/* No comment provided by engineer. */
"Synchronizing" = "Synchronizing";

/* No comment provided by engineer. */
"Sending data" = "Sending data";

/* No comment provided by engineer. */
"Getting data" = "Getting data";

"Pull to refresh" = "Pull to refresh";

/* help button Done */
"Done" = "Done";

"Passwords don't match" = "Passwords don't match";

"Password is changed" = "Password is changed";

"Password was sent to your e-mail" = "Password was sent to your e-mail";

"Register" = "Register";

"Login" = "Login";

/* post to FB */

"I solved test problem #%@ from the topic \"%@\"!" = "I solved test problem #%@ from the topic \"%@\"!";

"I solved all the test problems from the topic \"%@\"!" = "I solved all the test problems from the topic \"%@\"!";

"I solved olympiad problem #%@ of the first level of the \"%@\"!" = "I solved olympiad problem #%@ of the first level of the \"%@\"!";

"I solved the first level of the \"%@\"!" = "I solved the first level of the \"%@\"!";

/* paret hlep */

"- %@ level of difficulty" = "- %@ level of difficulty";

"- Solve %@ problems" = "- Solve %@ problems";

"- %@ test problems" = "- %@ test problems";

"%i. Witty olympiad problems %i levels with %@ problems in each" = "%i. Witty olympiad problems %i levels with %@ problems in each";

"A total of %@ problems, %@ test problems, %@ olympiad problems" = "A total of %@ problems, %@ test problems, %@ olympiad problems";

/* animation alert*/

"You need an internet connection in order to watch the animation" = "You need an internet connection in order to watch the animation";

"Server Error" = "The server is temporarily unavailable. We apologize for any inconvenience. We are enhancing the work of the sever. You can continue working offline or you can return to the app later.";

/*confirm alert */

"You need to confirm your e-mail before continue" = "You need to confirm your e-mail before continue";

"Remove child %@ confirmation" = "Do you want to delete %@'s account from the LocaMath app? All of the statistics will be deleted!";
"Remove child %@ confirmation email" = "A letter has been sent for you to confirm the deletion of your account. Check your mail and confirm that you want to delete %@'s account.";

"Confirm_ERROR" = "Error, passwords do not match!";

//Not translated
"Failed to get location, check your network connection" = "If location cannot be selected now please check Internet connection and update later on Settings Page";
"Dismiss" = "Dismiss";
"Invalid nickname. You can use only Latin/Cyrillic symbols, whitespaces, digits and symbols '.-_'. Maximum is 15 symbols" = "The name can consist of alphanumeric A-Z, 0-9; whitespace; special characters '.-_' with maximum length of 15 characters and minimum lenght of 2 characters.";
"Invalid email" = "Invalid email";
"Invalid password. Input from 6 to 15 symbols" = "Invalid password. Input from 6 to 15 characters";

//Warning on attempt to solve test tasks with 2 tasks failed already
"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type" = "Sorry, you must not have more than two mistakes to proceed. Please go back to previous sublevels and complete all problems";

"Censored nickname error" = "This name is not allowed. Please check and submit another name.";

//default popup
"Explain default label" = "To register, click «ok» to continue using the application, press «continue»";

"Explain default label0" = "Without registration:\n\n The child can not participate in the ranking and compete with other kids!\n\n Only one child will be able to use the app!\n\n You will not be able to get reports and statistics on the progress of your child!";

"Explain default label1" = "This section is for our teammates!\n\n Do you want to be in our team - ask your parents to register!";

"Explain default label2" = "Dear Parents,\n\n This is the page of reports and statistics.\n\n We need you to be registered to provide you information about your kid progress!";

"Set name for default child" = "Enter child name";

"Explain default label4" = "To register, click «ok» to continue using the application, press «cancel»!";

"Continue" = "Continue";

"Mistake put scheme message" = "You should find right item and drag it to build diagram";

"Points earned" = "Points earned";

" Child's progress will be lost!" = " Child's progress will be lost!";

"Attention" = "Attention!";

"https://www.facebook.com/Locamath" = "https://www.facebook.com/Locamath";

"fb_Locamath" = "fb://profile/279755092127204";

"The Internet connection appears to be offline." = "The Internet connection appears to be offline.";

"No internet connection, вы не можете зарегистрироваться через FB при отсутствии интернета, зарегистрируйтесь при помощи почты" = "With no internet connection you can register only with email";

"Edit" = "Edit";

"Save & Exit" = "Save & Exit";

"Check facebook permissions and try again later" = "Check facebook permissions and try again later";

"The version is application is lower than required/ Please update your application/" = "You should update application to make it works properly! ";

"Please enter your name" = "Enter your name";

//tutorial
"tap to see animation!" = "Tap here to see the animation!";

"tap to build diagram here!" = "Tap here to build diagram!";

"drag the items here to make diagram!" = "Drag the items here to make diagram!";

"tap to solve the problem!" = "Tap here to solve problem!";

"drag & drop the numbers here to solve the problem!" = "Drag the numbers here to solve the problem!";

"tap to see the mistake!" = "Tap here to see mistake";

//new solving

"Solution1" = "Solution";

"math expression" = "by math Expression";

"math solution" = "through Operations";

"scheme_success_message" = "Great! Diagram is done!";

"The same solutions, change one of them!" = "You entered the same solutions, edit or delete one of them!";
